Revit 2027 API
RevisionSettings.GetRevisionSettings Method
 Returns the RevisionSettings for the given project document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static RevisionSettings GetRevisionSettings(
	Document ccda
)
Public Shared Function GetRevisionSettings (
	ccda As Document
) As RevisionSettings
public:
static RevisionSettings^ GetRevisionSettings(
	Document^ ccda
)
static member GetRevisionSettings :
        ccda : Document -> RevisionSettings
Parameters
ccda Document
 The document to get the RevisionSettings from.
Return Value
RevisionSettings
 The RevisionSettings for the document.
Exceptions
Exception | Condition
ArgumentException |  ccda is not a project document.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RevisionSettings Class
Autodesk.Revit.DB Namespace